{
  "pathways": [
    {
      "title": "Use Track",
      "description": "Learn to use the tool so you can leverage it to your advantage. Successfully using any tool requires some knowledge and skill. This pathway will help you learn how to navigate Track so that you can track and prove your learning successfully.",
      "contentAreas": [
        {
          "title": "Navigating Track",
          "competencies": [
            {
              "title": "View Pathways",
              "description": "Explain how to view the pathways you follow, see your competencies and completion status."
            },
            {
              "title": "View your competencies and proofs",
              "description": "Navigate into a pathway to view required competencies and see the proofs you have added"
            },
            {
              "title": "View your profile",
              "description": "Navigate to your profile to view your learning journey."
            }
          ],
          "previous": [],
          "next": ["Using Track"]
        },
        {
          "title": "Using Track",
          "competencies": [
            {
              "title": "Add proof of your learning and competency",
              "description": "Utilize the 'Proof' feature to view and add a new proof to each competency in a learning path."
            },
            {
              "title": "Share your profile",
              "description": "Share your profile with others to showcase your learning journey and prove your knowledge and skills"
            }
          ],
          "previous": ["Navigating Track"],
          "next": []
        },
        {
          "title": "Learning",
          "competencies": [
            {
              "title": "Explain why it is necessary to prove your competency.",
              "description": "Proving your understanding isn't just Track functionality. Proving your understanding is a fundamental educational concept. How do you know that you know something?"
            },
            {
              "title": "Identify what makes a quality proof",
              "description": "What kind of artifact will truly highlight your skills, abilities, and knowledge? What makes an artifact or explanation prove your ability? Judging the value of your work is a key skill in learning."
            }
          ],
          "previous": [],
          "next": []
        }
      ]
    },
    {
      "title": "Learn to Learn",
      "description": "Utilize a growth mindset and grit to learn anything. Learning is a skill, just like riding a bike or cooking. In this pathway, learners will explore the science of learning and develop strategies to deepen their understanding and master skills. This pathway will help learners develop a growth mindset, resilience, and a love for learning. Learners will also learn how to manage time, self regulate, and explore learning strategies. This pathway is a great prerequisite for all other pathways.",
      "contentAreas": [
        {
          "title": "Learning",
          "competencies": [
            {
              "title": "Summarize the concept of Growth Mindset",
              "description": "Explain and justify the importance of a growth mindset in learning, and apply strategies to develop and maintain a growth mindset in learning."
            },
            {
              "title": "Practice Growth Mindset",
              "description": "When learning, implement what you summarized when learning about the concept of a growth mindset."
            },
            {
              "title": "Explore Critical Thinking",
              "description": "Justify the importance of thinking deeply about a concept and exploring concepts from multiple perspectives. When reading, writing, or practicing during learning, push yourself to go beyond memorization and recall."
            },
            {
              "title": "Reflect on Critical Thinking",
              "description": "How have you implemented what you learned about critical thinking in your learning? Reflect on your learning and how you have applied critical thinking."
            },
            {
              "title": "Research Feedback",
              "description": "Why is feedback important in learning?"
            },
            {
              "title": "Receive Feedback",
              "description": "Seek out feedback from a trusted source such as an instructor or professional in the field. Implement feedback to improve your learning and skills. Self-reflect and provide yourself feedback."
            }
          ],
          "previous": [],
          "next": []
        },
        {
          "title": "Metacognition",
          "competencies": [
            {
              "title": "Explore Self Regulation",
              "description": "Explain the importance of managing emotions, behavior, and motivation in learning, and identify strategies to self-regulate effectively, such as limiting applications on computers and phones, silencing phones, and practicing mindfulness techniques."
            },
            {
              "title": "Self Regulate",
              "description": "Select strategies and tools that you explored when learning about self regulation. Implement these strategies and tools. Reflect and iterate."
            },
            {
              "title": "Discover Time Management That Works for You",
              "description": "Research various time management strategies and tools such as time-blocking or the Pomodoro technique. Implement a time management strategy that works best for you."
            },
            {
              "title": "Discover Learning Strategies That Work for You",
              "description": "Identify and describe various learning strategies such as active learning, spaced repetition, mnemonic devices, collaborative learning, etc. Implement a learning strategy that works best for you."
            }
          ],
          "previous": [],
          "next": []
        }
      ]
    },
    {
      "title": "Illustration",
      "description": "This pathway is similar to a college level program in illustration and visual arts. To prove competency in this pathway, deep understanding and skill mastery will be required. Completion of this pathway could easily take years. Learners should expect to practice drawing, painting, digital art, writing, research, and learn tools to get started in the art industry. Learners should also consider reaching out to peers or experts for feedback, as receiving feedback and implementing changes is one of the best ways to grow as an artist.",
      "contentAreas": [
        {
          "title": "2D Design Fundamentals",
          "competencies": [
            {
              "title": "Define line, shape, form, proportion, and value",
              "description": "Define line, shape, form, proportion, and value, and explain how these elements are used in 2D design"
            },
            {
              "title": "Explore form and space in 2D design",
              "description": "Explain how to utilize and represent form and space in 2D design"
            },
            {
              "title": "Define composition principles",
              "description": "Define balance, contrast, hierarchy, emphasis, simplicity, movement, rhythm, negative space, and unity, to create visually engaging and dynamic compositions in drawings."
            },
            {
              "title": "Define Perspective",
              "description": "Summarize one-point, two-point, and three-point perspective, and explain how to apply these methods to create drawings and illustrations that accurately depict spatial relationships and depth."
            },
            {
              "title": "Explore 2D Design",
              "description": "Research 2D design fundamentals and dig into a particular area that interests you. Write about what you learned and how you can apply it to your work."
            }
          ],
          "previous": [],
          "next": [
            "Drawing",
            "Painting",
            "Illustration",
            "Professional Development",
            "Art History"
          ]
        },
        {
          "title": "Drawing",
          "competencies": [
            {
              "title": "Utilize line, shape, form, proportion, and value when drawing",
              "description": "Apply foundational drawing skills, such as line, shape, form, and proportion, to create drawings that demonstrate proficiency and understanding of these techniques."
            },
            {
              "title": "Depict Form and Space on Paper",
              "description": "Depict form and space on paper using a variety of drawing techniques, such as shading, cross-hatching, and rendering, to create the illusion of three-dimensional form and space."
            },
            {
              "title": "Implement Composition Principles",
              "description": "Implement balance, contrast, hierarchy, emphasis, simplicity, movement, rhythm, negative space, and unity, to create visually engaging and dynamic compositions in drawings."
            },
            {
              "title": "Apply Perspective Methods",
              "description": "Apply perspective methods, such as one-point, two-point, and three-point perspective, to create drawings and illustrations that accurately depict spatial relationships and depth."
            },
            {
              "title": "Evaluate and Critique Contemporary and Historical Art in the Context of Drawing",
              "description": "Evaluate and critique contemporary and historical art in the context of drawing, identifying and analyzing the formal elements, principles of design, and conceptual ideas present in the artwork."
            },
            {
              "title": "Reflect on Design Choices and Artistic Process In Drawing",
              "description": "Reflect on design choices and artistic process in drawing, identifying and analyzing the formal elements, principles of design, and conceptual ideas present in the artwork."
            }
          ],
          "previous": ["2D Design Fundamentals"],
          "next": ["Professional Development", "Life Drawing"]
        },
        {
          "title": "Painting",
          "competencies": [
            {
              "title": "Blend",
              "description": "Blend colors to create smooth transitions and gradations in paintings."
            },
            {
              "title": "Mix Colors",
              "description": "Mix colors to create a wide range of hues, tints, and shades in paintings."
            },
            {
              "title": "Dry Brush",
              "description": "Utilize dry brushing techniques to create texture and detail in paintings."
            },
            {
              "title": "Stipple",
              "description": "Utilize stippling techniques to create texture and detail in paintings."
            },
            {
              "title": "Underpaint",
              "description": "Establish tonal values, enhance color harmony, and create depth in paintings through underpainting techniques."
            },
            {
              "title": "Utilize various mediums",
              "description": "Practice with acrylic, oil, and watercolor mediums"
            },
            {
              "title": "Implement Composition Principles",
              "description": "Implement  balance, contrast, hierarchy, emphasis, simplicity, movement, rhythm, negative space, and unity, to create visually engaging and dynamic compositions in paintings."
            },
            {
              "title": "Apply Perspective Methods",
              "description": "Apply perspective methods, such as one-point, two-point, and three-point perspective, to create paintings that accurately depict spatial relationships and depth."
            },
            {
              "title": "Evaluate and Critique Contemporary and Historical Art in the Context of Painting",
              "description": "Evaluate and critique contemporary and historical art in the context of painting, identifying and analyzing the formal elements, principles of design, skills, and conceptual ideas present in the artwork."
            },
            {
              "title": "Reflect on Design Choices and Artistic Process In Painting",
              "description": "Reflect on design choices and artistic process in painting, identifying and analyzing the formal elements, principles of design, and conceptual ideas present in the artwork."
            }
          ],
          "previous": ["2D Design Fundamentals", "Drawing"],
          "next": ["Professional Development"]
        },
        {
          "title": "Life Drawing",
          "competencies": [
            {
              "title": "Label muscles and bones of the human body",
              "description": "Label the major muscle groups and bones of the human body to improve the proportions of your art."
            },
            {
              "title": "Label common proportion of the human face",
              "description": "Label the common proportions of the human face to improve the proportions of your art."
            },
            {
              "title": "Create dynamic poses and expressions",
              "description": "Create dynamic poses and expressions to convey life in your art."
            },
            {
              "title": "Draw anatomically correct figures and faces",
              "description": "Complete many drawings of people in various poses and expressions.Draw figures and faces from life, photographs, and imagination."
            }
          ],
          "previous": ["2D Design Fundamentals", "Drawing"],
          "next": ["Professional Development"]
        },
        {
          "title": "Illustration",
          "competencies": [
            {
              "title": "Research historic and current trends in illustration",
              "description": "Research historic and current trends in illustration and apply them to your work. Consider mediums and tools used by illustrators in the past and present. Consider styles and techniques used by illustrators in the past and present. Consider formats and genres used by illustrators in the past and present. Select a historic or current trend in illustration that interests you and write about it."
            },
            {
              "title": "Develop a unique style and voice",
              "description": "Develop a unique style and voice in your illustrations. Consider the formal elements and principles of design in your work. Consider the conceptual ideas and themes in your work. Consider the techniques and mediums in your work. Consider the formats and genres in your work. Create a series of illustrations that demonstrate your unique style and voice."
            },
            {
              "title": "Explore formats and genres in illustration",
              "description": "Create illustrations for books, magazines, advertisements, and other media. Create illustrations in genres such as fantasy, science fiction, horror, and more. Create illustrations in formats such as editorial, advertising, and children's books. Create illustrations that tell a story or convey a message. Create illustrations that evoke emotions or moods."
            },
            {
              "title": "Seek out feedback",
              "description": "Seek out feedback from peers and professionals to improve your work."
            }
          ],
          "previous": ["2D Design Fundamentals", "Drawing", "Life Drawing"],
          "next": ["Professional Development"]
        }
      ],
      "competencies": [
        {
          "title": "Create Digital Art",
          "description": "Create art in Photoshop, Illustrator, and Procreate. Explain and utilize layers, vectors, raster, and brushes. Create multiple projects utilizing various techniques and styles. Utilize digital art to create illustrations, concept art, and designs. Explain the importance of file formats and resolution. Apply traditional drawing and painting techniques to your digital work. ",
          "hasContentAreas": [
            {
              "title": "Digital Literacy"
            },
            {
              "title": "Digital Art"
            }
          ]
        },
        {
          "title": "Plan for Art as a Business",
          "description": "Reseach and explore marketing, copyright laws, and business practices for artists. Identify potential markets and create a business plan. Begin to develop a portfolio and resume. Create a website and social media presence. Network with other artists and professionals. Seek out opportunities to exhibit and sell your work. Explore online ways to sell your work as well as jobs that align with your skills.",
          "hasContentAreas": [
            {
              "title": "Business"
            },
            {
              "title": "Research"
            },
            {
              "title": "Marketing"
            }
          ]
        },
        {
          "title": "Create Illustrations for Clients",
          "description": "Seek out clients and create illustrations for them. Communicate with clients to understand their needs and expectations. Create multiple drafts and revisions. Deliver high-quality illustrations on time. Create contracts and invoices. Develop a professional relationship with clients. Seek out feedback from clients to improve your work. Implement workflows and processes to streamline your work.",
          "hasContentAreas": [
            {
              "title": "Business"
            },
            {
              "title": "Marketing"
            },
            {
              "title": "Illustration"
            }
          ]
        },
        {
          "title": "Explore Mediums to Innovate",
          "description": "Create artwork using mediums such as printmaking, mixed media, sculpture, photography, and more. Research and explore new mediums and techniques. Create a series of artworks using a new medium. Reflect on your experience and the results. Seek out feedback from peers and professionals. Implement new techniques and mediums into your work.",
          "hasContentAreas": [
            {
              "title": "3D Design Fundamentals"
            },
            {
              "title": "2D Design Fundamentals"
            },
            {
              "title": "Research"
            },
            {
              "title": "Sculpture"
            }
          ]
        },
        {
          "title": "Create Graphic Novels",
          "description": "Tell a story using sequential art. Consider time, layout, and style to convey a narrative. Create characters, settings, and plot. Develop a script and storyboard. Create multiple drafts and revisions. Utilize traditional and digital techniques. Explore different styles and genres. Seek out feedback from peers and professionals. Implement feedback to improve your work.",
          "hasContentAreas": [
            {
              "title": "Illustration"
            },
            {
              "title": "2D Design Fundamentals"
            }
          ]
        },
        {
          "title": "Develop a Professional Portfolio",
          "description": "Create original illustrations that demonstrate your skills and style. Organize your work into a cohesive portfolio. Create a website or physical portfolio. Write an artist statement and update your resume and social media presence. Seek out opportunities to exhibit and sell your work. Network with other artists and professionals. Seek out feedback from peers and professionals to improve your portfolio.",
          "hasContentAreas": [
            {
              "title": "Illustration"
            },
            {
              "title": "Business"
            },
            {
              "title": "Marketing"
            }
          ]
        },
        {
          "title": "Justify the Importance of the Context of Art in History",
          "description": " Identify major artists, movements, and periods including Western and non-Western art. Research time periods from prehistory to medieval and Renaissance to today. Research and write about several topics and movements within these histories that interests you. Reflect on how art has changed and influenced society. In your writings, showcase your ability to communicate clearly and effectively.",
          "hasContentAreas": [
            {
              "title": "Art History"
            },
            {
              "title": "Research"
            },
            {
              "title": "Writing"
            }
          ]
        }
      ]
    },
    {
      "title": "Computer Science",
      "description": "Embark on a comprehensive self-learning journey in Computer Science, inpsired by college-level programs. Achieving mastery in this pathway demands a dedicated commitment, and the process may span several years. This pathway involves many content areas, including programming, algorithms, data structures, software development methodologies, databases, and computer architecture. Hands-on coding projects and collaborative learning will be integral to the process. Networking with fellow learners, participating in online communities, and seeking mentorship from experienced professionals will enhance the learning experience. Regularly applying learned concepts in practical scenarios and staying updated with industry trends will be crucial; you must build projects. Embracing a growth mindset, resilience, and continuous curiosity are key attributes for success in this self-learning path.",
      "competencies": [
        {
          "title": "Apply Concepts in Calculus",
          "description": "Analyze and solve complex mathematical problems involving limits, continuity, derivatives, integrals, optimization, areas and volumes, as well as apply calculus principles to real-world scenarios, statistical analysis, and probability distributions. Work with functions, graphs, and polynomial, exponential, and logarithmic functions. Explore techniques of integration, areas and volumes, numerical integration, improper integrals, single variable continuous statistics, exponential and normal distributions, and Central Limit Theorem.",
          "hasContentAreas": [
            {
              "title": "Mathematics"
            }
          ]
        },
        {
          "title": "Explore Discrete Mathematics",
          "description": "Engage with abstract, discrete structures fundamental to computer science. Complete exercises with logics and proofs, boolean algebra and functions, set theory, finite and infinite sequences and series, and relations, graphs, and trees.",
          "hasContentAreas": [
            {
              "title": "Mathematics"
            },
            {
              "title": "Programming"
            }
          ]
        },
        {
          "title": "Describe and Implement Data Structures",
          "description": "Implement and manipulate fundamental data structures such as arrays, linked lists, stacks, queues, trees, graphs, and hash tables in C#, Java, C, or C++, utilizing Object Oriented Design principles.",
          "hasContentAreas": [
            {
              "title": "Programming"
            }
          ]
        },
        {
          "title": "Describe and Implement Common Algorithms",
          "description": "Implement and describe fundamental algorithms such as divide and conquer, dynamic programming, greedy algorithms, graph algorithms, and sorting algorithms in C#, Java, C, or C++, utilizing Object Oriented Design principles. Explain and iterate on you problem solving process. Explain Big O notation and analyze the time and space complexity of algorithms.",
          "hasContentAreas": [
            {
              "title": "Programming"
            }
          ]
        },
        {
          "title": "Explain Modern Computer Architecture",
          "description": "Summarize the organization and architecture of modern computer systems, including CPU, memory, input/output devices, and storage systems. Analyze and design digital circuits and systems using concepts such as Boolean algebra, logic gates, combinational and sequential circuits, and memory systems. Evaluate and optimize computer system performance through techniques such as pipelining, caching, and parallel processing.",
          "hasContentAreas": [
            {
              "title": "Programming"
            }
          ]
        },
        {
          "title": "Implement Fundamental Security Measures",
          "description": "Identify and explain common threats and vulnerabilities in infosec such as malware, phishing, social engineering, DoS attacks, and vulnerabilities within software and systems. Explain the fundamentals of cryptography techniques and algorithms to improve the integrity of data. Implement security measures such as access control, authentication, authoriation, and encryption to protect data and systems. Explore network security practices such as network design, firelwalls, VPNS and secure protocols. ",
          "hasContentAreas": [
            {
              "title": "Programming"
            }
          ]
        },
        {
          "title": "Programming Language Fundamentals",
          "description": "Utilize Java, C#, C, or C++ to design and develop applications using an Object Oriented Paradigm. Utilize and explain encapsulation, inheritance, polymorphism, and abstraction. Use libraries and frameworks to build applications. Research popular debugging techniques to improve your speed and accuracy in application creation. Utilize version control systems to manage your code. Utilize IDEs or commonly used professional tools to develop.",
          "hasContentAreas": [
            {
              "title": "Programming"
            }
          ]
        },
        {
          "title": "Create Non-trivial Applications in C#, Java, C, or C++",
          "description": "Push yourself to create applications that mirror applications in the real world. Research and implement best practices in software development. Utilize design patterns to create scalable and maintainable applications. Utilize testing frameworks to ensure your applications are bug free. Utilize version control systems to manage your code. Utilize IDEs or commonly used professional tools to develop. Seek out ideas for projects and feedback from peers and professionals.",
          "hasContentAreas": [
            {
              "title": "Programming"
            }
          ]
        },
        {
          "title": "Explore Scripting Languages",
          "description": "Pick a scripting language and build applications with it. Utilize Python, Ruby, or JavaScript to build applications, as well as appropriate respective libraries. Research and implement best practices in software development. Utilize testing frameworks to ensure your applications are bug free. Utilize version control systems to manage your code. Utilize IDEs or commonly used professional tools to develop. Seek out ideas for projects and feedback from peers and professionals. Identify the ways that these languages differ from the languages you have learned before.",
          "hasContentAreas": [
            {
              "title": "Programming"
            },
            {
              "title": "Web Development"
            }
          ]
        },
        {
          "title": "Explain Software Development in a Professional Setting",
          "description": "Utilize a professional workflow to create an application. This may mean using an Agile or Scrum methodology and researching deeply to correctly implement the process. If you are able, seek out a client and create an application based on their requirements and feedback. Deliver functionality iteratively. Utilize version control systems to manage your code. Utilize IDEs or commonly used professional tools to develop. Seek out ideas for projects and feedback from peers and professionals. Research and plan to use modern software development practices.",
          "hasContentAreas": [
            {
              "title": "Programming"
            }
          ]
        },
        {
          "title": "Manage Data",
          "description": "Create data models and explore the use of databases and tables. Utilize Sql to query a database by adding data, modifying data, getting data, and deleting data. Databases should include foreign and primary keys and SQL queries should utilize clauses. Use MySQL and PostgresQL databases. Explain the difference between SQL and NoSQL databases. Explain how to normalize data. Utilize an ORM. Identify performance issues with queries and databases.",
          "hasContentAreas": [
            {
              "title": "Programming"
            }
          ]
        },
        {
          "title": "Explore the Business Side of Software Development",
          "description": "Create a web presence, start a portfolio, create a resume. Research and identify jobs, career paths, and companies that you are interested in. Seek out internships, apprenticeships, or jobs in the field. Research and identify the skills and tools that are in demand. Seek out feedback from peers and professionals. Research and identify the skills and tools that are in demand. Seek out feedback from peers and professionals.",
          "hasContentAreas": [
            {
              "title": "Programming"
            },
            {
              "title": "Business"
            }
          ]
        },
        {
          "title": "Explore the use of AI in programming",
          "description": "Practice prompting and correcting output from various AI sources such as Copilot, ChatGPT, and Llama. Utilize AI tools in creation of applications and projects while identifying the issues and limitations. Practice judging output critically and deeply thinking about code quality and security. Treat AI as a tool to be used in conjunction with your own skills.",
          "hasContentAreas": [
            {
              "title": "Programming"
            },
            {
              "title": "Digital Literacy"
            }
          ]
        },
        {
          "title": "Create a Portfolio of Projects",
          "description": "This portfolio will be the main tool to demonstrate your abilities to employers. Without it or a degree, employers may not be able to verify your ability. Your portfolio should include non-trivial projects that demonstrate skills employers want. Seek out feedback from peers and professionals. Research and identify the skills and tools that are in demand. Follow best practices, a workflow or professional work methodoly/process, version control, project boards, planning, design, testing, deployment, and maintenance. Your work should be professional and clean.",
          "hasContentAreas": [
            {
              "title": "Programming"
            }
          ]
        }
      ]
    },
    {
      "title": "Front End Development Fundamentals",
      "description": "When users interact with a web page or application, they're really interacting with the front end. This pathway is designed to help you learn the skills you need to become a front end developer. You'll learn how to build web pages and applications using HTML, CSS, and JavaScript. You'll also learn how to use popular front end frameworks and libraries like React, Vue, or Angular. This pathway does not focus on design in any way - it is a myth that front end web development is rooted in design. This pathway is for those who want to build the interactive parts of a website or application using code and problem solving skills.",
      "competencies": [
        {
          "title": "Utilize HTML and CSS to Create Web Pages",
          "description": "Utilize HTML and CSS to create web pages that are visually appealing, responsive, and accessible. Implement best practices for structuring content, styling elements, and optimizing performance such as WAI-ARIA, Semantic HTML, and CSS organization.",
          "hasContentAreas": [
            {
              "title": "Web Development"
            }
          ]
        },
        {
          "title": "Implement Responsive Web Design",
          "description": "Implement responsive web design techniques using media queries, flexbox, and grid to create web pages that adapt to different screen sizes and devices.",
          "hasContentAreas": [
            {
              "title": "Web Development"
            }
          ]
        },
        {
          "title": "Utilize JavaScript",
          "description": "Loop through arrays using traditional for loops and JavaScript array methods. Work with objects, variables, math, and strings. Utilize functions, scope, and closures. You'll need to know the basics of JavaScript in order to complete this competency; content includes variables, functions, conditionals, arrays, expressions, objects, and more. Work locally and in the browser console. Utilize debugging tools to identify and fix errors. You'll need to research Node.js, npm, and the command line to complete this competency.",
          "hasContentAreas": [
            {
              "title": "Web Development"
            }
          ]
        },
        {
          "title": "Create Web Pages with JavaScript",
          "description": "Utilize JavaScript to manipulate the DOM, handle events, and create interactive web pages. Implement asynchronous programming using callbacks, promises, and async/await. Consider the separate of the data and the view when designing your code. Explain what event bubbling and delegation is. Utilize the fetch API to make requests to a server. Identify your debugging process and research modern debugging techniques to improve your speed and accuracy in application creation. You should utilize GitHub or Bitbucket or similar tool to manage your code. You'll need to reserach Git in order to complete this competency.",
          "hasContentAreas": [
            {
              "title": "Web Development"
            }
          ]
        },
        {
          "title": "Create Web Applications with CSS, HTML, and JavaScript",
          "description": "Complete multiple projects that manipulate data and the DOM using HTML, CSS, and JavaScript. Utilize best practices for organizing code, structuring files, and optimizing performance. Utilize the fetch API to make requests to a server. Utilize the fetch API to make requests to a server.  Utilize version control systems to manage your code. Utilize IDEs or commonly used professional tools to develop. Seek out ideas for projects and feedback from peers and professionals.",
          "hasContentAreas": [
            {
              "title": "Web Development"
            }
          ]
        },
        {
          "title": "Use React to Create Web Applications",
          "description": "Capture user input using forms, manage state, and create reusable components in React. Utilize React Router to create a single-page application with multiple views. Utilize hooks such as useState, useEffect, and useContext. Build multiple projects utilizing React, CSS, JSX/HTML and JavaScript. Utilize version control systems to manage your code. Utilize the fetch API to make requests to a server. Utilize IDEs or commonly used professional tools to develop. Seek out ideas for projects and feedback from peers and professionals.",
          "hasContentAreas": [
            {
              "title": "Web Development"
            }
          ]
        },
        {
          "title": "Practice TypeScript",
          "description": "Build on your knowledge of JavaScript by learning TypeScript. Utilize TypeScript to create web applications that are more maintainable, scalable, and reliable. Utilize TypeScript's static typing, interfaces, and type annotations to catch errors early in development. Utilize TypeScript with React to create web applications that are more maintainable, scalable, and reliable.",
          "hasContentAreas": [
            {
              "title": "Web Development"
            }
          ]
        },
        {
          "title": "Explore Modern Front End Tooling",
          "description": "Research and work with the following tools: NPM, ESLint, Prettier, Webpack, Babel, and Git. Utilize these tools to improve your workflow, code quality, and collaboration. Utilize version control systems to manage your code.",
          "hasContentAreas": [
            {
              "title": "Web Development"
            }
          ]
        },
        {
          "title": "Explain Network Requests",
          "description": "Explain how network requests work on the internet. Identify and explain GET requests, POST requests. Implement various requests in your projects and code. Utilize tools such as the Fetch API or Axios to make requests in React and JavaScript code.",
          "hasContentAreas": [
            {
              "title": "Web Development"
            }
          ]
        },
        {
          "title": "Handle Errors",
          "description": "Identify and handle errors in your code. Utilize try/catch blocks, error objects, and error handling techniques. Utilize error boundaries in React to catch errors in your components. Utilize debugging tools to identify and fix errors.",
          "hasContentAreas": [
            {
              "title": "Web Development"
            }
          ]
        },
        {
          "title": "Explore advanced JavaScript",
          "description": "Show off your skills in JavaScript by implementing code that illustrates closures, promises, higher order functions, currying, generators and any modern features or design practices that interest you.",
          "hasContentAreas": [
            {
              "title": "Web Development"
            }
          ]
        }
      ]
    },
    {
      "title": "Unity 2D Game Development",
      "description": "This pathway will guide learners to create 2D games utilizing the Unity Engine. This pathway includes fundamentals of Unity's 2D features, including sprite management, physics, animation, and user interface design. Starting with basic concepts, such as setting up a project and navigating the Unity interface, learners will progress to more advanced topics like scripting in C#, implementing game mechanics, optimizing performance, and publishing games to various platforms. Learners should push to build their own games instead of simply consuming related educational content.",
      "competencies": [
        {
          "title": "Unity 2d Competencies Coming Soon!",
          "description": "Competencies currently under development. All pathways will receive updated competencies soon.",
          "hasContentAreas": [
            {
              "title": "Programming"
            }
          ]
        }
      ]
    },
    {
      "title": "Digital Marketing",
      "description": "Explore the dynamic field of digital marketing, encompassing social media marketing, search engine optimization (SEO), content marketing, email marketing, and digital advertising platforms like Google Ads and Facebook Ads. This pathway will guide learners to develop a comprehensive understanding of digital marketing strategies, tools, and techniques. Learners should focus on hands-on experience by creating and executing digital marketing campaigns.",
      "competencies": [
        {
          "title": "Digital Marketing Competencies Coming Soon!",
          "description": "Competencies currently under development. All pathways will receive updated competencies soon.",
          "hasContentAreas": [
            {
              "title": "Programming"
            }
          ]
        }
      ]
    },
    {
      "title": "Creative Writing",
      "description": "Explore creative writing to refine your craft and cultivate your unique voice. Practice consistently, engage with feedback, and study storytelling fundamentals to craft compelling narratives. Develop well-rounded characters, craft engaging plots, and create vivid settings that transport readers into the heart of the narrative.",
      "competencies": [
        {
          "title": "Creative Writing Competencies Coming Soon!",
          "description": "Competencies currently under development. All pathways will receive updated competencies soon.",
          "hasContentAreas": [
            {
              "title": "Programming"
            }
          ]
        }
      ]
    },
    {
      "title": "Public Speaking Fundamentals",
      "description": "Develop essential public speaking skills, including overcoming stage fright, organizing speeches, delivering effective presentations, and engaging with audiences confidently.",
      "competencies": [
        {
          "title": "Public Speaking Competencies Coming Soon!",
          "description": "Competencies currently under development. All pathways will receive updated competencies soon.",
          "hasContentAreas": [
            {
              "title": "Programming"
            }
          ]
        }
      ]
    },
    {
      "title": "Mindfulness and Meditation Fundamentals",
      "description": "Explore the principles and techniques of meditation and mindfulness to reduce stress, improve focus, and cultivate a greater sense of well-being in daily life. This pathway will guide learners to develop a consistent meditation practice and integrate mindfulness into their daily routines.",
      "competencies": [
        {
          "title": "Mindfulness and Meditation Competencies Coming Soon!",
          "description": "Competencies currently under development. All pathways will receive updated competencies soon.",
          "hasContentAreas": [
            {
              "title": "Programming"
            }
          ]
        }
      ]
    },
    {
      "title": "Music Perforamance Fundamentals",
      "description": "Begin a foundational journey in music performance, focusing on essential skills applicable to any instrument. This pathway introduces instrument pedagogy, covering techniques like posture and hand positioning, alongside fundamental music theory such as scales, intervals, and rhythm. Learners will develop technical proficiency through exercises and repertoire, including scales, arpeggios, and finger exercises, while also honing ear training and sight-reading abilities. Regular practice sessions and performance opportunities will solidify learning, with feedback from instructors and peers guiding progress towards confident and expressive musical performance.",
      "competencies": [
        {
          "title": "Music Performance Fundamentals competencies Coming Soon!",
          "description": "Competencies currently under development. All pathways will receive updated competencies soon.",
          "hasContentAreas": [
            {
              "title": "Programming"
            }
          ]
        }
      ]
    },
    {
      "title": "Japanese Language",
      "description": "Gain proficiency in the Japanese language through this pathway, which is closely modeled after traditional university degrees. Learners will practice grammar, vocubulary, reading, writing, and oral communication skills. This pathway will also guide learners to explore Japanese culture and history, and to engage with native speakers to practice their language skills. Learners should expect to spend several years to achieve proficiency in the fundamentals of Japanese language.",
      "competencies": [
        {
          "title": "Japanese Language Competencies Coming Soon!",
          "description": "Competencies currently under development. All pathways will receive updated competencies soon.",
          "hasContentAreas": [
            {
              "title": "Programming"
            }
          ]
        }
      ]
    },
    {
      "title": "Event Planning and Management",
      "description": "Learn the principles and practices of event planning and management, including event design, budgeting, logistics, vendor management, marketing, and coordination, to organize successful events such as conferences, weddings, and corporate functions.",
      "competencies": [
        {
          "title": "Event Planning Competencies Coming Soon!",
          "description": "Competencies currently under development. All pathways will receive updated competencies soon.",
          "hasContentAreas": [
            {
              "title": "Programming"
            }
          ]
        }
      ]
    },
    {
      "title": "Artistic Roller Skating",
      "description": "Master the art of roller skating through artistic expression. Learners will develop fundamental skating skills, including balance, agility, and coordination, while also exploring artistic elements such jumps, styles, and choreography. This pathway will guide learners to develop a skating routine, and to engage in regular practice opportunities to refine their skills. Learners should also seek feedback from experienced skaters to improve their technique and artistry. This pathway is designed for people who want to learn to roller skate with no prior experience and strive for artistic expression through skating.",
      "competencies": [
        {
          "title": "Roller Skating Competencies Coming Soon!",
          "description": "Competencies currently under development. All pathways will receive updated competencies soon.",
          "hasContentAreas": [
            {
              "title": "Programming"
            }
          ]
        }
      ]
    },
    {
      "title": "Project Management",
      "description": "This pathway will prepare learners to successfully manage projects by providing a comprehensive understanding of project management principles, tools, and techniques. Learners will explore project initiation, planning, execution, monitoring, and closing, while also developing essential skills such as leadership, communication, and risk management. Learners should focus on hands-on experience by managing real-world projects, and seek mentorship from experienced project managers to guide their learning journey.",
      "competencies": [
        {
          "title": "Project Management Competencies Coming Soon!",
          "description": "Competencies currently under development. All pathways will receive updated competencies soon.",
          "hasContentAreas": [
            {
              "title": "Programming"
            }
          ]
        }
      ]
    },
    {
      "title": "Culinary Arts",
      "description": "This pathway mirrors the curriculum of professional culinary schools. Covering fundamental techniques, kitchen operations, culinary theory, and practical skills, learners progress from kitchen safety and knife skills to advanced cooking methods like sautéing, braising, and pastry arts. Culinary theory components include flavor profiles, menu planning, and kitchen management, complementing hands-on cooking experience. Learners should seek out feedback from industry professionals and get involved in the local culinary scene.",
      "competencies": [
        {
          "title": "Culinary Arts Competencies Coming Soon!",
          "description": "Competencies currently under development. All pathways will receive updated competencies soon.",
          "hasContentAreas": [
            {
              "title": "Programming"
            }
          ]
        }
      ]
    },
    {
      "title": "Emotional Intelligence Fundamentals",
      "description": "Cultivate self-awareness, self-regulation, empathy, and social skills to navigate emotions effectively, build positive relationships, and manage interpersonal conflicts with empathy and understanding.",
      "competencies": [
        {
          "title": "Emotional Intelligence Competencies Coming Soon!",
          "description": "Competencies currently under development. All pathways will receive updated competencies soon.",
          "hasContentAreas": [
            {
              "title": "Programming"
            }
          ]
        }
      ]
    },
    {
      "title": "Financial Literacy Fundamentals",
      "description": "Gain knowledge in budgeting, saving, investing, debt management, and financial planning to make informed financial decisions, achieve financial goals, and build long-term financial security.",
      "competencies": [
        {
          "title": "Financial Literacty Competencies Coming Soon!",
          "description": "Competencies currently under development. All pathways will receive updated competencies soon.",
          "hasContentAreas": [
            {
              "title": "Programming"
            }
          ]
        }
      ]
    },
    {
      "title": "Mixology Fundamentals",
      "description": "Dive into the world of cocktails, learning about different spirits, mixers, and cocktail recipes to create delicious drinks for yourself and others.",
      "competencies": [
        {
          "title": "Mixology Competencies Coming Soon!",
          "description": "Competencies currently under development. All pathways will receive updated competencies soon.",
          "hasContentAreas": [
            {
              "title": "Programming"
            }
          ]
        }
      ]
    },
    {
      "title": "Outdoor Survival Fundamentals",
      "description": "Learn basic survival skills such as fire starting, shelter building, navigation, and foraging to feel confident and prepared for outdoor adventures.",
      "competencies": [
        {
          "title": "Outdoor Survival Competencies Coming Soon!",
          "description": "Competencies currently under development. All pathways will receive updated competencies soon.",
          "hasContentAreas": [
            {
              "title": "Programming"
            }
          ]
        }
      ]
    },
    {
      "title": "Birdwatching Fundamentals",
      "description": "Embrace the wonders of birdwatching, learning how to identify common bird species, use binoculars, and keep a bird journal to document your sightings and observations in nature",
      "competencies": [
        {
          "title": "Birdwatching Competencies Coming Soon!",
          "description": "Competencies currently under development. All pathways will receive updated competencies soon.",
          "hasContentAreas": [
            {
              "title": "Programming"
            }
          ]
        }
      ]
    },
    {
      "title": "Graphic Design",
      "description": "This pathway focuses on visual communication, typography, layout design, and digital media production, providing learners with skills in graphic design software, branding, and multimedia design, and preparing them for careers in graphic design, advertising, digital media, or web design. Similar to a college degree, learners will need to develop a portfolio of work to demonstrate their skills and knowledge as well as demonstrate proficiency in fundamentals through projects, research, and collaboration. Learners should expect to spend several years to achieve proficiency in the field of graphic design.",
      "competencies": [
        {
          "title": "Design Competencies Coming Soon!",
          "description": "Competencies currently under development. All pathways will receive updated competencies soon.",
          "hasContentAreas": [
            {
              "title": "Programming"
            }
          ]
        }
      ]
    },
    {
      "title": "Philosophy",
      "description": "This pathway delves into the fundamental questions concerning existence, knowledge, ethics, and the nature of reality. Through rigorous inquiry and critical analysis, learners explore diverse philosophical traditions, from ancient Greek philosophy to contemporary thought. They engage with topics such as metaphysics, epistemology, ethics, logic, political philosophy, and aesthetics, examining philosophical texts, arguments, and theories to develop their analytical, critical thinking, and argumentation skills. Througout years of study, learners should emphasize research, writing, and oral communication, and forumulating and defedning their own philosophical viewpoints through essays, debates, and presentations",
      "competencies": [
        {
          "title": "Philosophy Competencies Coming Soon!",
          "description": "Competencies currently under development. All pathways will receive updated competencies soon.",
          "hasContentAreas": [
            {
              "title": "Programming"
            }
          ]
        }
      ]
    },
    {
      "title": "SQL Fundamentals",
      "description": "Learn to manipulate data using SQL commands, including SELECT, INSERT, UPDATE, and DELETE, gaining proficiency in retrieving, filtering, and organizing data from relational databases.",
      "competencies": [
        {
          "title": "SQL Fundamentals Competencies Coming Soon!",
          "description": "Competencies currently under development. All pathways will receive updated competencies soon.",
          "hasContentAreas": [
            {
              "title": "Programming"
            }
          ]
        }
      ]
    }
  ]
}
